"""
常量 与 Pylint规范
constant 常量
1 常量的值一旦定义了，就不能再去改变了，如果改变了，那么程序将会报错 ~
2 在python中其实常量还是变量，因为在python中没有一个定义机制是常量还是变量
3 形式上的常量我们都是需要大写的 全部大写字母 ~
4 理解常量不是真正意义上的常量 -- 出现在大量的笔试题上
5 一个python文件就叫一个模块
6 如果变量不是位于函数或者类中，那么pyint都认为是常量，直接把变量丢在模块下面，这样的编码并不是一个好的编码习惯
7 对于逻辑运算符都是需要空出一个空格的，不然python还是会给你错误提示的


加s ifelse语句 嵌套分支 代码块的概念 snippet
1 snippet  片段
2 pass 占位语句/空语句
3 接口只有名称没有实现的 交互的标准
4 变量的作用域的结构体
5 代码块中的代码中只要有一行代码被执行，那么其他的代码块中的代码也会被执行的



"""

if condition:
    pass  # 占位符 伪代码
else:
    pass  # 结构体完成的代码












